
## Plan Result (style-bert-vits2)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/21540050291)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.github_actions_repository_permissions.this[0]
  * module.this.github_branch_default.this
  * module.this.github_repository.this_from_fork[0]
  * module.this.github_repository_ruleset.this[&#34;master&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.github_actions_repository_permissions.this[0] will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "all"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "Style-Bert-VITS2"
    }

  # module.this.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "Style-Bert-VITS2"
    }

  # module.this.github_repository.this_from_fork[0] will be created
  + resource "github_repository" "this_from_fork" {
      + allow_auto_merge            = true
      + allow_forking               = (known after apply)
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Style-Bert-VITS2: Text to Speech model"
      + etag                        = (known after apply)
      + fork                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "Style-Bert-VITS2"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + source_owner                = "litagin02"
      + source_repo                 = "Style-Bert-VITS2"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.this.github_repository_ruleset.this["master"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "master"
      + node_id     = (known after apply)
      + repository  = "Style-Bert-VITS2"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + deletion                      = false
          + non_fast_forward              = false
          + required_linear_history       = true
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = true
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":1470,"Program":"tfcmt","SHA1":"1371cab139e1757883fb869a06a77e6bb1a24e88","Target":"style-bert-vits2","Vars":{},"WorkflowName":"Terraform - GitHub"} -->